[
  {
    "category": "trust",
    "question": "Have you ever been tempted while in a relationship? How did you handle it?"
  },
  {
    "category": "trust",
    "question": "What’s something you’ve never told a past partner that you feel comfortable telling me?"
  },
  {
    "category": "trust",
    "question": "Do you believe people can change? Why or why not?"
  },
  {
    "category": "trust",
    "question": "What’s your biggest fear when it comes to us?"
  },
  {
    "category": "trust",
    "question": "When was the last time you lied in a relationship? Why?"
  },
  {
    "category": "trust",
    "question": "What kind of attention from others would cross a line for you?"
  },
  {
    "category": "trust",
    "question": "What can I do to make you feel safe in this relationship?"
  },
  {
    "category": "trust",
    "question": "What can I do to make you feel safe in this relationship?"
  },
  {
    "category": "trust",
    "question": "If I looked through your phone right now, would I find anything I’d question?"
  },
  {
    "category": "connection",
    "question": "When do you feel closest to me?"
  },
  {
    "category": "connection",
    "question": "What’s something small I do that makes you smile inside?"
  },
  {
    "category": "connection",
    "question": "If we could improve one thing in how we connect, what would it be?"
  },
  {
    "category": "connection",
    "question": "What’s one memory of us that you replay in your head?"
  },
  {
    "category": "growth",
    "question": "What part of yourself are you currently working on?"
  },
  {
    "category": "growth",
    "question": "How do you usually handle conflict or disagreements?"
  },
  {
    "category": "sex",
    "question": "What’s your wildest sexual fantasy involving just the two of us?"
  },
  {
    "category": "sex",
    "question": "What’s something dirty you’ve imagined during the day... about me?"
  },
  {
    "category": "sex",
    "question": "If we were alone with no rules for one night, what would you want to do?"
  },
  {
    "category": "flirt",
    "question": "What outfit of mine turns you on the most?"
  },
  {
    "category": "flirt",
    "question": "If we were alone on a weekend getaway, what would you want us to do all day?"
  },
  {
    "category": "flirt",
    "question": "What's one way I could tease you that would drive you crazy—in a good way?"
  }
]
